Day12_java/Ex16_2.java

/* 16장.상속.pdf No.20쪽 1번문제)
 *  강의 교안 소스 중에서 접근 권한이 잘못된 번호를 기술하고, 보다 더 좋은 OOP(객체지향 프로그래밍) 자바 코드로
 *  변경해 본다.(불필요한 코드 제거)
 * 
 */
// 잘못된 부분 정답 번호는 [1]번 과 [5]번 과 [9]
class Parent02 { // extends Object이 생략됨
	private int a;
	int b;
	protected int c;
	public int d;
}// 부모클래스 Parent02

class Child02 extends Parent02 {
	public Child02(int a, int b, int c, int d) {
		//this.a = a; // [1]	정답 -> 부모 Parents02에서 private 으로 정의된 멤버변수 a는 같은 패키지의 자손클래스에서 접근 못함
		this.b = b; // [2]
		this.c = c; // [3]
		this.d = d; // [4]
	}// 매개변수가 다른 생성자 오버로딩

	void func() {
		//System.out.println(a); // [5] 정답
		System.out.println(b); // [6]
		System.out.println(c); // [7]
		System.out.println(d); // [8]
	}// 사용자 정의 메서드 func()
}// 자손클래스 Child02

public class Ex16_2 {

	public static void main(String[] args) {
		Child02 one = new Child02(1, 2, 3, 4);
		one.func();
	}

}
////////////////////////////////////////////////////////////
class Parent {
	private int a; // 같은 클래스에서만 사용가능한 멤버변수
	int b;
	protected int c;
	public int d;
	
	public Parent(int a, int b, int c, int d) {
		this.a = a;
		this.b = b; 
		this.c = c; 
		this.d = d; 
	}
	
	protected int getA() {
		return a;
	}
}

class Child extends Parent {
	public Child(int a, int b, int c, int d) {
		super(a, b, c, d);
	}

	void func() {
		System.out.println(getA()); // [5]
		System.out.println(b); // [6]
		System.out.println(c); // [7]
		System.out.println(d); // [8]
	}
}

public class Ex16_2 {

	public static void main(String[] args) {
		Child one = new Child(1, 2, 3, 4);
		one.func();
	}

}

/*======================================================================*/

Day12_java/Ex16_3.java

/* 16장.상속.pdf No.21쪽 2번문제)
 *  상속 구조에서 생성자의 호출 순서를 알아보기 위한 문제이다. 이 부분을 확인해 보고, 부모클래스 멤버변수를 상속받아서
 *  자손에게 출력시키는 메서드 public void pr(){} 사용자 정의 메서드를 정의해 본다.
 */

class Parent03 {
	protected int a, b, c;

	public Parent03() {
		super(); // 생략가능함. 최고 조상 부모클래스 Object 의 기본생성자 호출
		System.out.println("1.Parent03 클래스의 디폴트 생성자 호출");
	}// 기본 생성자

	public Parent03(int a, int b, int c) {
		// super(); 가 생략됨
		System.out.println("3.Parent03 클래스의 전달인자 3개짜리 생성자 호출");
		this.a = a;
		this.b = b;
		this.c = c; // 생성자의 주된 기능인 인스턴스 변수 초기화
	}// 매개변수 3개짜리 오버로딩 생성자
}// Parent2 부모클래스

class Child03 extends Parent03 {
	public Child03() {
		System.out.println("2.Child03 클래스의 디폴트 생성자 호출");
	}// 기본 생성자

	public Child03(int a, int b, int c) {
		super(a, b, c); // 부모클래스 오버로딩 된 생성자 호출
		System.out.println("4.Child03 클래스의 전달인자 3개짜리 생성자 호출");
	}

	public void pr() {
		System.out.println("a = " + a + ", b = " + b + ", c = " + c);
	}

}// Child2 자손클래스

public class Ex16_3 {

	public static void main(String[] args) {
		Child03 one = new Child03(); // 자손의 기본생성자 호출
		one.pr();// 0, 0, 0
		Child03 two = new Child03(10, 20, 30);// 자손의 매개변수 3개짜리 오버로딩 된 생성자를 호출
		two.pr();// 10, 20, 30

	}

}


////////////////////////////////////////////////////////////

class Parent2{
	protected int a, b, c;
	
	public Parent2() {
		System.out.println("1.Parent2 클래스의 디폴트 생성자 호출");
	}// 기본 생성자
	
	public Parent2(int a, int b, int c) {
		System.out.println("3.Parent 클래스의 전달인자 3개짜리 생성자 호출");
		this.a = a;
		this.b = b;
		this.c = c;
	}// 매개변수 3개짜리 오버로딩 생성자
}// Parent2 부모 클래스

class Child2 extends Parent2{
	public Child2() {
		System.out.println("2.Child2 클래스의 디폴트 생성자 호출");
	}// 기본 생성자
	
	public Child2(int a, int b, int c) {
		super(a, b, c);
		System.out.println("4.Child2 클래스의 전달인자 3개짜리 생성자 호출");
	}
	
	public void pr() {
		System.out.println("a = " + a + ", b = " + b + ", c = " + c);
	}
	
}// Child2 자손 클래스
public class Ex16_3 {

	public static void main(String[] args) {
		Child2 one = new Child2();
		Child2 two = new Child2(10, 20, 30);
		one.pr();
		two.pr();		

	}

}
/*======================================================================*/

/*======================================================================*/

/*======================================================================*/

/*======================================================================*/

/*======================================================================*/

/*======================================================================*/

/*======================================================================*/

/*======================================================================*/

/*======================================================================*/

/*======================================================================*/

/*======================================================================*/

/*======================================================================*/

/*======================================================================*/

/*======================================================================*/

/*======================================================================*/

/*======================================================================*/

/*======================================================================*/

/*======================================================================*/

/*======================================================================*/

/*======================================================================*/

/*======================================================================*/

/*======================================================================*/

/*======================================================================*/

/*======================================================================*/

/*======================================================================*/

/*======================================================================*/

/*======================================================================*/

/*======================================================================*/

/*======================================================================*/


